if object_id('customers2') IS NOT NULL drop table customers2
CREATE TABLE customers2(
	customerid char(50) primary key,
	name char(100),
	gender char(50),
	areaid char(100),
	phone int,
	email char(100),
	adress char(100),
	qq char(100),
	birthdate date,
	weixin char(100)
)
insert into customers2 values('C2013','朱翼','男','120000','15611245','157578@qq.com','天津市','157578','1997-2-19','zh49id'),
('C2014','秦婷婷','女','120200','15611246','157579@qq.com','天津市属县','157579','1997-2-19','zh49id'),
('C2015','折蓉蓉','女','120221','15611247','157580@qq.com','天津市宁河县','157580','1997-2-19','zh49id'),
('C2016','曹丽娜','女','120223','15611248','157581@qq.com','天津市静海县','157581','1997-2-19','zh49id'),
('C2017','刘彬彬','男','120221','15611249','157582@qq.com','天津市宁河县','157582','1997-2-19','zh49id'),
('C2018','唐芳','女','120223','15611250','157583@qq.com','天津市静海县','157583','1997-2-19','zh49id'),
('C2019','陈科生','男','120223','15611251','157584@qq.com','天津市静海县','157584','1997-2-19','zh49id'),
('C2020','谭军红','男','120221','15611252','157585@qq.com','天津市宁河县','157585','1997-2-19','zh49id'),
('C2021','刘艳芳','女','120223','15611253','157586@qq.com','天津市静海县','157586','1997-2-19','zh49id'),
('C2022','周彦楠','男','120000','15611254','157587@qq.com','天津市','157587','1997-2-19','zh49id'),
('C2023','王晶 ','男','120223','15611255','157588@qq.com','天津市静海县','157588','1997-2-19','zh49id'),
('C2024','肖东菁 ','女','120221','15611256','157589@qq.com','天津市宁河县','157589','1997-2-19','zh49id'),
('C2025','邓天文','男','120100','15611257','157590@qq.com','天津市','157590','1997-2-19','zh49id'),
('C2026','邓天文','男','120100','15611258','157591@qq.com','天津市','157591','1997-2-19','zh49id'),
('C2027','廖丽霞','女','120100','15611259','157592@qq.com','天津市','157592','1997-2-19','zh49id'),
('C2028','朱佳婧','女','120000','15611260','157593@qq.com','天津市','157593','1997-2-19','zh49id'),
('C2029','韩冬 ','男','120100','15611261','157594@qq.com','天津市','157594','1997-2-19','zh49id'),
('C2030','孙巍','男','120223','15611262','157595@qq.com','天津市静海县','157595','1997-2-19','zh49id')
if object_id('orders2') IS NOT NULL drop table orders2
CREATE TABLE orders2(
	customerid char(50) ,
	orderid char(50) primary key,
	severice char(100),
	time1 char(50),
	date1 date,
	request char(250)
)
insert into orders2 values('C2013','O1001','定做一个商务系统','6天','2018-3-05','要求系统可以和外网链接……'),
('C2013','O1002','监察方案','7天','2018-3-25','要求系统可以和外网链接……'),
('C2013','O1003','定做联系网站','14天','2018-4-10','要求系统可以和外网链接……'),
('C2013','O1004','设计项目报告','5天','2018-7-05','要求系统可以和外网链接……'),
('C2013','O1005','考察数据准确性','8天','2018-9-05','要求系统可以和外网链接……'),
('C2014','O1006','考察基地','19天','2018-9-05','要求系统可以和外网链接……')

select * from orders2